<template>
  <div class="telegram-settings-view">
    <noo-section
      title="Привязка телеграм-аккаунта"
      description="Здесь Вы можете привязать свой телеграм-аккаунт для получения уведомлений о работах, дедлайнах и других событиях. Для этого потребуется авторизоваться через Telegram, нажав на кнопку ниже. После успешной авторизации Ваш телеграм-аккаунт будет привязан к Вашему профилю в системе, и Вы начнете получать уведомления"
    >
      <noo-telegram-login-button />
      <br />
      <noo-warning-block small>
        Платформа получит доступ только к тем данным Вашего телеграм-аккаунта,
        которые видно всем пользователям телеграма (имя, фамилия, никнейм и id).
        Ваши личные сообщения, контакты и другая приватная информация останутся
        недоступными для платформы
      </noo-warning-block>
    </noo-section>
  </div>
</template>
